const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '最佳损友',
        author: '陈奕迅',
        www:'https://p1.music.126.net/AAKrMZu-zyunLRqAMO9JlA==/109951166577890720.jpg?param=130y130',
        audio:"gq/zjsy.mp3",
        lyric: "[00:00.000] 作词 : 黄伟文\n[00:00.166] 作曲 : Eric Kwok\n[00:00.332] 编曲 : Eric Kwok/Jerald\n[00:00.500]\n[00:00.900]朋友 我当你一秒朋友\n[00:07.081]朋友 我当你一世朋友\n[00:13.691]奇怪 过去再不堪回首\n[00:20.460]怀缅 时时其实还有\n[00:25.599]\n[00:27.047]朋友 你试过将我营救\n[00:33.797]朋友 你试过把我批斗\n[00:40.401]无法 再与你交心联手\n[00:46.241]毕竟 难得有过最佳损友\n[00:51.737]\n[00:52.169]从前共你 促膝把酒\n[00:54.987]倾通宵都不够\n[00:56.531]我有痛快过 你有没有\n[01:00.851]很多东西今生只可给你\n[01:03.210]保守至到永久\n[01:05.004]别人如何明白透\n[01:07.441]实实在在 踏入过我宇宙\n[01:09.849]即使相处到 有个裂口\n[01:13.343]命运决定了 以后再没法聚头\n[01:16.908]但说过去 却那样厚\n[01:19.171]\n[01:19.631]问我有没有 确实也没有\n[01:22.851]一直躲避的借口 非甚么大仇\n[01:26.145]为何旧知己 在最后\n[01:29.574]变不到老友\n[01:32.844]不知你是我敌友 已没法望透\n[01:36.573]被推着走 跟着生活流\n[01:39.493]来年陌生的\n[01:41.617]是昨日最亲的某某\n[01:47.021]\n[01:50.868]生死之交当天不知罕有\n[01:53.298]到你变节了 至觉未够\n[01:57.411]多想一天 彼此都不追究\n[01:59.923]相邀再次喝酒\n[02:01.629]待 葡萄成熟透\n[02:04.106]但是命运入面 每个邂逅\n[02:06.537]一起走到了 某个路口\n[02:09.955]是敌与是友 各自也没有自由\n[02:13.506]位置变了 各有队友\n[02:15.903]\n[02:16.234]问我有没有 确实也没有\n[02:19.554]一直躲避的借口 非甚么大仇\n[02:22.767]为何旧知己 在最后\n[02:26.142]变不到老友\n[02:29.481]不知你是我敌友 已没法望透\n[02:33.258]被推着走 跟着生活流\n[02:36.138]来年陌生的\n[02:38.199]是昨日最亲的某某\n[02:41.528]早知解散后 各自有际遇作导游\n[02:46.188]奇就奇在 接受了 各自有路走\n[02:49.493]却没人像你 让我 眼泪背着流\n[02:52.794]严重似情侣 讲分手\n[02:57.690]\n[03:10.314]有没有 确实也没有\n[03:12.832]一直躲避的借口 非甚么大仇\n[03:16.127]为何旧知己 在最后 变不到老友\n[03:22.075]\n[03:22.820]不知你又有没有 挂念这旧友\n[03:26.647]或者自己 早就想通透\n[03:29.442]来年陌生的 是昨日 最亲的某某\n[03:34.779]总好于 那日我 没有\n[03:39.925]没有 遇过 某某\n[03:48.493]\n[03:49.301]监制 : Eric Kwok / Jerald Chan / Eason Chan\n[03:49.968]Producer : Eric Kwok / Jerald Chan\n[03:50.499]Producer, Associated  Performer, Vocals : Eason Chan\n[03:50.997]Author : Wei Wen Huang\n[03:51.461]Composer, Arranger, Work  Arranger : Eric Kwok\n[03:51.921]Arranger, Work  Arranger : Jerald Chan\n[03:52.378]Released on : 2006-01-01\n[03:52.808]OP : Snowman Production Ltd(adm by EMI Music Publishing HK)\n[03:52.908]/Wyman(adm by EMI Music Publishing HK)\n[03:53.227]/℗ 2006 Cinepoly Records Co. Ltd.\n"
    }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}
